[
  {
    "code": "FAR",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "What Is Fine Arts?",
          "fr-ca": "Qu’est-ce que les beaux-arts?"
        },
        "contents": {
          "en-ca": "Fine arts as a subject in Alberta includes the disciplines of music, visual arts, dance, and drama. Each of the fine arts disciplines is significant in its own right, with its own specific and unique vocabulary, language, and foundational knowledge. An understanding of the disciplines of fine arts has been formed throughout history and across diverse cultures. In fine arts, students explore inherited traditions, great works, and foundational knowledge within each discipline through opportunities for creating, presenting, appreciating, and responding. Music and visual arts are required courses in Kindergarten to Grade 6, while dance and drama are both optional.",
          "fr-ca": "En Alberta, les beaux-arts comprennent les disciplines de la musique, des arts visuels, de la danse et de l’art dramatique. Chacune des disciplines des beaux-arts est importante en soi, avec son vocabulaire, sa langue et ses connaissances fondamentales spécifiques et uniques. Une compréhension des disciplines des beaux-arts s’est formée tout au long de l’histoire et à travers diverses cultures. Dans les beaux-arts, les élèves explorent les traditions héritées, les grandes œuvres et les connaissances fondamentales de chaque discipline à travers des occasions de créer, de présenter, d’apprécier et de réagir. La musique et les arts visuels sont des cours obligatoires de la maternelle à la sixième année, tandis que la danse et l’art dramatique sont tous deux optionnels."
        }
      },
      {
        "titles": {
          "en-ca": "Why Is Fine Arts Important?",
          "fr-ca": "Pourquoi les beaux-arts sont-ils importants?"
        },
        "contents": {
          "en-ca": "Through fine arts, students are empowered to discover themselves as artistic individuals and contributing members of society. Fine arts provides opportunities for students to develop emotionally, physically, intellectually, imaginatively, aesthetically, and socially, allowing them to identify unique talents and develop their personal potential. Lifelong learning is a central tenet of fine arts, providing students with opportunities to transfer skills and knowledge acquired, including literacy and numeracy, to other subject areas. By fostering critical thinking, problem solving, and communication, fine arts provides students with the opportunity to make deeper connections across the Alberta curriculum.<br/><br/>Authentic, hands-on experiences that are personally relevant and meaningful help students communicate and connect their understanding of the world in new and imaginative ways. Development of discipline-specific skills and techniques promotes personal and artistic growth in an atmosphere that is rigorous yet non-competitive, cooperative, supportive, and joyful. Students can take risks, be innovative, and strengthen their sense of purpose, belonging, personal well-being, and resiliency. Experiencing the diversity of the arts and artistic expression throughout history and within various cultures contributes to students’ awareness of and appreciation for diverse perspectives. It also allows them to see the truth, beauty, and goodness that is inherent in diverse works of art. Fine arts is vital for fostering a supportive society that develops empathy, intellectual growth, and curiosity.",
          "fr-ca": "Grâce aux beaux-arts, les élèves ont la possibilité de se découvrir en tant qu’individus artistiques et membres actifs de la société. Les beaux-arts offrent aux élèves la possibilité de se développer émotionnellement, physiquement, intellectuellement, imaginativement, esthétiquement et socialement, ce qui leur permet d’identifier des talents uniques et de développer leur potentiel personnel. L’apprentissage tout au long de la vie est un principe central des beaux-arts, offrant aux élèves la possibilité de transférer les compétences et les connaissances acquises, y compris la littératie et la numératie, vers d’autres disciplines. En favorisant la pensée critique, la résolution de problèmes et la communication, les beaux-arts donnent aux élèves la possibilité d’établir des liens plus approfondis avec le programme d’études de l’Alberta.<br/><br/>Des expériences authentiques et pratiques, qui sont personnellement pertinentes et significatives, aident les élèves à communiquer et à relier leur compréhension du monde de manière nouvelle et imaginative. L’acquisition de compétences et de techniques spécifiques à la discipline favorise la croissance personnelle et artistique dans une atmosphère à la fois rigoureuse et non compétitive, coopérative, solidaire et joyeuse. Les élèves peuvent prendre des risques, être innovateurs et renforcer leur raison d’être, leur sentiment d’appartenance, leur bienêtre personnel et leur résilience. Faire l’expérience de la diversité des arts et de l’expression artistique à travers l’histoire et au sein de diverses cultures contribue à sensibiliser les élèves à la diversité des perspectives et à les apprécier. Cela leur permet également de voir la vérité, la beauté et la bonté qui sont inhérentes aux diverses œuvres d’art. Les beaux-arts sont essentiels pour favoriser une société solidaire qui développe l’empathie, la croissance intellectuelle et la curiosité."
        }
      }
    ]
  },
  {
    "code": "FARDAN",
    "parentCode": "FAR",
    "sections": [
      {
        "titles": {
          "en-ca": "Dance (optional)",
          "fr-ca": "Danse (facultatif)"
        },
        "contents": {
          "en-ca": "Dance is both a physical activity and a mode of artistic expression in which ideas are expressed and shared. It is an art form in which the dancer is the instrument and movement is the medium. As students cultivate and refine dance skills and techniques, they develop both verbal and non-verbal communication through which they can create, present, appreciate, respond, and connect to the world around them. Creative movement and dance is developed through purposeful engagement with the elements of dance, choreographic forms, devices, and principles. Through creative processes, students learn that individual and collaborative dance fosters the expression of ideas, feelings, and experiences. Cultural literacy in dance is gained through the exploration of historical and contemporary dance forms and traditions.",
          "fr-ca": "La danse est à la fois une activité physique et un mode d’expression artistique à travers lequel les idées sont exprimées et partagées. C’est une forme d’art dans laquelle le danseur est l’instrument et le mouvement est le médium. En cultivant et en affinant leurs compétences et leurs techniques de danse, les élèves développent une communication verbale et non verbale qui leur permet de créer, de présenter et d’apprécier le monde qui les entoure, ainsi que d’y réagir et de s’y connecter. Le mouvement créatif et la danse sont développés par un engagement délibéré avec les éléments de la danse, les formes chorégraphiques, les dispositifs et les principes. Grâce à des processus créatifs, les élèves apprennent que la danse individuelle et collective favorise l’expression des idées, des sentiments et des expériences. La littératie culturelle à travers la danse s’acquiert par l’exploration des formes et des traditions de danse historiques et contemporaines."
        }
      }
    ]
  },
  {
    "code": "FARDMA",
    "parentCode": "FAR",
    "sections": [
      {
        "titles": {
          "en-ca": "Drama (optional)",
          "fr-ca": "Art dramatique (facultatif)"
        },
        "contents": {
          "en-ca": "Drama is a medium for individual and group expression that fosters the pursuit of shared goals. Students learn to reflect and collaborate through creative interactions using the body and voice as expressive tools in the development of resiliency, empathy, and confidence. As students cultivate and refine dramatic skills and techniques, they develop both verbal and non-verbal communication through which they can create, present, appreciate, respond, and connect to the world around them. Dramatic processes allow students to develop perspectives through the exploration of characters, moods, and situations within historical, cultural, and contemporary contexts.",
          "fr-ca": "L’art dramatique est un moyen d’expression individuel et collectif qui favorise la poursuite d’objectifs communs. Les élèves apprennent à réfléchir et à collaborer par le biais d’interactions créatives utilisant le corps et la voix comme outils d’expression dans le développement de la résilience, de l’empathie et de la confiance. En cultivant et en affinant leurs compétences et techniques dramatiques, les élèves développent une communication verbale et non verbale qui leur permet de créer, de présenter et d’apprécier le monde qui les entoure, ainsi que d’y réagir et de s’y connecter. Les processus dramatiques permettent aux élèves de développer des perspectives par l’exploration de personnages, d’humeurs et de situations dans des contextes historiques, culturels et contemporains."
        }
      }
    ]
  },
  {
    "code": "FARGEN",
    "parentCode": "FAR",
    "sections": [
      {
        "titles": {
          "en-ca": "Music (required)",
          "fr-ca": "Musique (obligatoire)"
        },
        "contents": {
          "en-ca": "The music curriculum provides opportunities for students to connect to the world around them through creating, presenting, appreciating, and responding to music. As students become aware of the expressive elements of music, they develop insight into human experience. Foundational knowledge and understanding of the elements of music supports students in developing music literacy and skills through active musical engagement in the areas of singing, playing, listening, moving, reading, and writing. This knowledge serves as the foundation from which students can further develop an understanding of and appreciation for the beauty of music within historical, cultural, and contemporary contexts. Through creative processes, students learn that individual and collaborative music making fosters the expression of ideas, feelings, and experiences.",
          "fr-ca": "Le programme de musique offre aux élèves la possibilité de se connecter au monde qui les entoure en créant, en présentant et en appréciant la musique, et en y réagissant. En prenant conscience des éléments expressifs de la musique, les élèves acquièrent une connaissance de l’expérience humaine. La connaissance fondamentale et la compréhension des éléments de la musique aident les élèves à développer leur littératie musicale et leurs compétences grâce à un engagement musical actif dans les domaines du chant, du jeu, de l’écoute, du mouvement, de la lecture et de l’écriture. Ces connaissances servent de base à partir de laquelle les élèves peuvent continuer à développer une compréhension et une appréciation de la beauté de la musique dans des contextes historiques, culturels et contemporains. Grâce à des processus créatifs, les élèves apprennent que la pratique individuelle et collective de la musique favorise l’expression des idées, des sentiments et des expériences."
        }
      }
    ]
  },
  {
    "code": "FARART",
    "parentCode": "FAR",
    "sections": [
      {
        "titles": {
          "en-ca": "Visual Arts (required)",
          "fr-ca": "Arts visuels (obligatoire)"
        },
        "contents": {
          "en-ca": "Visual arts enables students to express themselves creatively as they grow in their ability to explore, imagine, and represent their understandings of the world through artworks. Foundational knowledge and understanding of the elements and principles of art supports students in developing visual arts literacy and skills. Through creative processes, students learn that individual and collaborative art making fosters meaningful artistic expression. Creating and presenting artworks allows students to express ideas, feelings, and experiences by using artistic vocabulary, skills, media, and methods. Appreciating, interpreting, and responding to works of art prepares students to understand and appreciate enduring historical, cultural, and contemporary works of art and artists.",
          "fr-ca": "Les arts visuels permettent aux élèves de s’exprimer de manière créative, à mesure qu’ils grandissent dans leur capacité d’explorer, d’imaginer et de représenter leur compréhension du monde par le biais d’œuvres d’art. La connaissance fondamentale et la compréhension des éléments et des principes de l’art aident les élèves à développer leurs connaissances et leurs compétences en matière d’arts visuels. Grâce aux processus créatifs, les élèves apprennent que la pratique individuelle et collective des arts visuels favorise une expression artistique significative. La création et la présentation d’œuvres d’art permettent aux élèves d’exprimer des idées, des sentiments et des expériences en utilisant le vocabulaire, les compétences, les médias et les méthodes artistiques. Apprécier et interpréter les œuvres d’art, et y réagir, préparent les élèves à comprendre et à apprécier les œuvres d’art durables historiques, culturelles et contemporaines, et les artistes."
        }
      }
    ]
  },
  {
    "code": "MAT",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "What Is Mathematics?",
          "fr-ca": "Qu’est-ce que les mathématiques?"
        },
        "contents": {
          "en-ca": "Mathematics is a subject in which students study patterns and relationships to understand various aspects of the world. Mathematical understanding is connected to many branches of mathematics, including arithmetic, algebra, geometry, data, statistics, and probability. The procedures associated with mathematics range from counting, calculating, and measuring to analyzing, modelling, and generalizing. Communication is also fundamental to mathematics. The language of mathematics has its own system of symbolic notation and a specific vocabulary with which to communicate mathematical thinking concisely. <br/><br/> Mathematical skills and knowledge support the interpretation of diverse quantitative and spatial information and can be applied to solving both theoretical and practical problems. With mathematics, abstract ideas can be visualized, represented, and explained. Mathematics is a powerful tool that can be used to simplify and solve complicated real-life problems.",
          "fr-ca": "Les mathématiques sont une matière dans laquelle les élèves étudient des régularités et des relations pour comprendre divers aspects du monde. La compréhension des mathématiques est liée à de nombreuses branches des mathématiques, notamment l’arithmétique, l’algèbre, la géométrie, les données, les statistiques et la probabilité. Les procédures associées aux mathématiques vont du comptage, du calcul et de la mesure à l’analyse, la modélisation et la généralisation. La communication est également fondamentale pour les mathématiques. Le langage des mathématiques possède son propre système de notation symbolique et un vocabulaire spécifique avec lequel il est possible de communiquer de manière concise la pensée mathématique. <br/><br/> Les habiletés et connaissances mathématiques appuient l’interprétation de diverses informations quantitatives et spatiales et peuvent être appliquées à la résolution de problèmes théoriques et pratiques. Avec les mathématiques, les idées abstraites peuvent être visualisées, représentées et expliquées. Les mathématiques sont un outil puissant qui peut être utilisé pour simplifier et résoudre des problèmes complexes et réels."
        }
      },
      {
        "titles": {
          "en-ca": "Why Is Mathematics Important?",
          "fr-ca": "Pourquoi les mathématiques sont-elles importantes?"
        },
        "contents": {
          "en-ca": "Mathematics is central to the development of numeracy: the ability to engage with quantitative and spatial information in a variety of situations. Mathematics is necessary in many pursuits of daily life, including comparing costs, locating a destination, interpreting a schedule, or adapting a recipe. Students become numerate as they learn the foundational skills and knowledge of mathematics, including mental processes and standard algorithms that are useful both in and beyond their learning environments. <br/><br/> As students learn and apply mathematics, they build the critical thinking skills required to analyze information and make decisions carefully in a wide range of situations. Many important life skills, such as financial literacy, rely on the foundational skills and knowledge of mathematics. Many careers use the logical or creative thinking and perseverance developed during the study of mathematics. Students will continue to use their mathematical learning as they contemplate new ideas in their schools, communities, and future workplaces.",
          "fr-ca": "Les mathématiques sont au cœur du développement de la numératie : la capacité à s’engager avec des informations quantitatives et spatiales dans une variété de situations. Les mathématiques sont nécessaires dans de nombreuses activités de la vie quotidienne, notamment pour comparer les couts, localiser une destination, interpréter un horaire ou adapter une recette. Les élèves développent leur capacité de calculer à mesure qu’ils acquièrent les habiletés et les connaissances de base en mathématiques, y compris les processus mentaux et les algorithmes usuels qui sont utiles à la fois dans leur environnement d’apprentissage et au-delà. <br/><br/> En apprenant et en appliquant les mathématiques, les élèves acquièrent les habiletés de la pensée critique nécessaires pour analyser des informations et prendre des décisions avec soin dans un large éventail de situations. De nombreuses compétences importantes dans la vie courante, comme l’éducation financière, reposent sur les compétences et les connaissances fondamentales en mathématiques. De nombreuses carrières font appel à la pensée logique ou créative et à la persévérance développées pendant l’étude des mathématiques. Les élèves continueront à utiliser leur apprentissage des mathématiques lorsqu’ils comtempleront de nouvelles idées dans leurs écoles, leurs communautés et leurs futurs lieux de travail."
        }
      }
    ]
  },
  {
    "code": "SSS",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "What Is Social Studies?",
          "fr-ca": "Qu’est-ce que les études sociales?"
        },
        "contents": {
          "en-ca": "Social studies is an interdisciplinary, content-rich subject that empowers students to be lifelong learners. It draws from history, geography, civics, economics, and other disciplines. Social studies provides opportunities for students to learn about and appreciate ideas that have shaped Alberta, Canada, and the world over time. Students acquire foundational knowledge and build understandings of relationships between people, places, and environments. They acquire a growing body of essential knowledge on historical and contemporary controversial issues. Students revisit content as knowledge builds from grade to grade. In social studies, students develop skills that will prepare them to lead fulfilling lives and play a significant role in our democratic society.",
          "fr-ca": "Les études sociales sont une matière interdisciplinaire et riche en contenu qui permet aux élèves d’apprendre tout au long de leur vie. Elle s’appuie sur l’histoire, la géographie, l’éducation civique, l’économie et d’autres disciplines. Les études sociales offrent aux élèves la possibilité de découvrir et d’apprécier les idées qui ont façonné l’Alberta, le Canada et le monde au fil du temps. Les élèves acquièrent des connaissances de base et construisent une compréhension des relations entre les personnes, les lieux et les environnements. Ils acquièrent un ensemble de connaissances essentielles sur des problématiques controversées historiques et contemporaines. Les élèves revoient le contenu au fur et à mesure que les connaissances s’accumulent d’une année à l’autre. En études sociales, les élèves développent des compétences qui les préparent à mener une vie épanouie et à jouer un rôle important dans notre société démocratique."
        }
      },
      {
        "titles": {
          "en-ca": "Why Is Social Studies Important?",
          "fr-ca": "Pourquoi les études sociales sont-elles importantes?"
        },
        "contents": {
          "en-ca": "In social studies, students learn about<br/><ul><li>diverse events, people, places, and ideas related to local communities, Alberta, Canada, and the world</li> <li>the nature of work, economies, and financial literacy</li> <li>the connections between people, places, and environments</li> <li>the origins of ideas, viewpoints, religions, and cultures to foster understanding and tolerance</li> </ul> By examining events, people, developments, and ideas in a sequential historical context, students build foundational knowledge of shared culture, tradition, and history. In this way, social studies fosters respect for people of diverse backgrounds that transcends differences and unites us in a pluralistic society. <br/><br/> In the examination of the history of Alberta, Canada, and the world, social studies addresses various perspectives that reflect Canada’s diversity. Social studies promotes pluralism so that we may live together in a democratic society that values inclusion, freedom, and justice. Students explore the histories, contributions, and perspectives of Indigenous peoples, including treaty rights and the importance of reconciliation. Students also examine the histories, contributions, and perspectives of Francophone communities in Alberta.",
          "fr-ca": "Dans les études sociales, les élèves apprennent à connaitre : <br/> <ul> <li>divers évènements, personnes, lieux et idées liés aux communautés locales, à l’Alberta, au Canada et au monde</li> <li>la nature du travail, les économies et la littératie financière</li> <li>les liens entre les personnes, les lieux et les environnements</li> <li>l’origine des idées, des points de vue, des religions et des cultures pour favoriser la compréhension et la tolérance.</li> </ul> En examinant les évènements, les personnes, les développements et les idées dans un contexte historique séquentiel, les élèves acquièrent des connaissances de base sur la culture, la tradition et l’histoire communes. De cette manière, les études sociales favorisent le respect des personnes d’origines diverses, qui transcende les différences et nous unit dans une société pluraliste. <br/><br/> Dans l’examen de l’histoire de l’Alberta, du Canada et du monde, les études sociales abordent diverses perspectives qui reflètent la diversité du Canada. Les études sociales favorisent le pluralisme afin que nous puissions vivre ensemble dans une société démocratique qui valorise l’inclusion, la liberté et la justice. Les élèves explorent l’histoire, les contributions et les perspectives des peuples autochtones, y compris les droits issus de traités et l’importance de la réconciliation. Les élèves examinent également l’histoire, les contributions et les perspectives des communautés francophones de l’Alberta."
        }
      }
    ]
  },
  {
    "code": "LANFRA",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "Qu’est-ce que Français langue première et littérature?",
          "fr-ca": "Qu’est-ce que Français langue première et littérature?"
        },
        "contents": {
          "en-ca": "Français langue première et littérature est le cours de français pour les élèves inscrits dans les écoles francophones. Le curriculum de ce cours définit dans un langage clair et précis ce que les élèves doivent savoir, comprendre et être capables de faire pour maitriser la langue française et en apprécier la beauté et la richesse. <br/><br/> L’étude de la langue offre aux élèves l’occasion d’acquérir des compétences et des connaissances fondamentales présentées de manière séquentielle et permettant de faire évoluer leur niveau de littératie en français. En appliquant des connaissances et habiletés reliées à la conscience phonologique, la phonétique, l’orthographe correcte des mots, l’acquisition du vocabulaire et la fluidité en lecture, les élèves développent une compréhension des liens qui existent entre la langue orale et la langue écrite et les caractéristiques grammaticales et textuelles propres au français permettant ainsi une communication claire et efficace. <br/><br/> Français langue première et littérature offre aux élèves les contextes nécessaires pour approfondir leurs compréhensions et habiletés langagières tout au long de leur parcours scolaire et pour trouver en même temps du plaisir à communiquer avec confiance et respect en français en utilisant un langage verbal et un langage non verbal inclusifs. <br/><br/> Français langue première et littérature permet aux élèves de comprendre les liens étroits qui existent entre le sentiment d’appartenance et la langue. Les expériences avec des textes littéraires et culturels d’une variété de genres et d’époques offrent aux élèves l’occasion de se situer par rapport à leurs origines, de reconnaitre les perspectives et les histoires des Premières Nations, des Métis, des <em>Inuit</em> et des francophones ainsi que d’apprendre au sujet de diverses réalités sociales et historiques de l’Alberta, du Canada et du monde.",
          "fr-ca": "Français langue première et littérature est le cours de français pour les élèves inscrits dans les écoles francophones. Le curriculum de ce cours définit dans un langage clair et précis ce que les élèves doivent savoir, comprendre et être capables de faire pour maitriser la langue française et en apprécier la beauté et la richesse. <br/><br/> L’étude de la langue offre aux élèves l’occasion d’acquérir des compétences et des connaissances fondamentales présentées de manière séquentielle et permettant de faire évoluer leur niveau de littératie en français. En appliquant des connaissances et habiletés reliées à la conscience phonologique, la phonétique, l’orthographe correcte des mots, l’acquisition du vocabulaire et la fluidité en lecture, les élèves développent une compréhension des liens qui existent entre la langue orale et la langue écrite et les caractéristiques grammaticales et textuelles propres au français permettant ainsi une communication claire et efficace. <br/><br/> Français langue première et littérature offre aux élèves les contextes nécessaires pour approfondir leurs compréhensions et habiletés langagières tout au long de leur parcours scolaire et pour trouver en même temps du plaisir à communiquer avec confiance et respect en français en utilisant un langage verbal et un langage non verbal inclusifs. <br/><br/> Français langue première et littérature permet aux élèves de comprendre les liens étroits qui existent entre le sentiment d’appartenance et la langue. Les expériences avec des textes littéraires et culturels d’une variété de genres et d’époques offrent aux élèves l’occasion de se situer par rapport à leurs origines, de reconnaitre les perspectives et les histoires des Premières Nations, des Métis, des <em>Inuit</em> et des francophones ainsi que d’apprendre au sujet de diverses réalités sociales et historiques de l’Alberta, du Canada et du monde."
        }
      },
      {
        "titles": {
          "en-ca": "Pourquoi le programme de Français langue première et littérature est-il important?",
          "fr-ca": "Pourquoi le programme de Français langue première et littérature est-il important?"
        },
        "contents": {
          "en-ca": "De la maternelle à la 6<sup>e</sup> année, les élèves acquièrent des connaissances de base et développent des habiletés de communication en vivant des expériences signifiantes avec les textes. Un texte, numérique et non numérique, est tout ce qui est écrit, oral ou visuel, est porteur de sens et sert à communiquer ou à transmettre un message. Les élèves examinent diverses façons de formuler et de présenter des idées, et de construire et d’exprimer du sens leur permettant de communiquer efficacement dans une variété de contextes. <br/><br/> Les élèves reconnaissent le rôle de la langue dans le développement de la pensée et dans la compréhension de points de vue véhiculés dans des œuvres diverses. Cette matière offre également aux élèves l’occasion de développer un sentiment d’appartenance envers des communautés francophones par l’exposition à une gamme de référents culturels présentés dans des textes authentiques de la francophonie.",
          "fr-ca": "De la maternelle à la 6<sup>e</sup> année, les élèves acquièrent des connaissances de base et développent des habiletés de communication en vivant des expériences signifiantes avec les textes. Un texte, numérique et non numérique, est tout ce qui est écrit, oral ou visuel, est porteur de sens et sert à communiquer ou à transmettre un message. Les élèves examinent diverses façons de formuler et de présenter des idées, et de construire et d’exprimer du sens leur permettant de communiquer efficacement dans une variété de contextes. <br/><br/> Les élèves reconnaissent le rôle de la langue dans le développement de la pensée et dans la compréhension de points de vue véhiculés dans des œuvres diverses. Cette matière offre également aux élèves l’occasion de développer un sentiment d’appartenance envers des communautés francophones par l’exposition à une gamme de référents culturels présentés dans des textes authentiques de la francophonie."
        }
      }
    ]
  },
  {
    "code": "PDE",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "What Is Physical Education and Wellness?",
          "fr-ca": "Qu’est-ce que l’éducation physique et le bienêtre?"
        },
        "contents": {
          "en-ca": "Physical education and wellness curriculum supports a strength-based focus that promotes the development of the whole individual and aims to nurture students in their pursuit of a healthy and active life. From Kindergarten to Grade 6, students are supported on their journey of achieving optimal well-being through a healthy school community that emphasizes<br/><ul><li>movement skills development</li><li>active living</li><li>growth and physical development</li><li>safety</li><li>personal development, mental health, and well-being</li><li>nutrition and healthy eating</li><li>healthy relationships</li></ul>",
          "fr-ca": "Le programme d’éducation physique et de bienêtre met l’accent sur les forces, favorise le développement de l’individu dans son ensemble et vise à encourager les élèves à mener une vie saine et active. De la maternelle à la sixième année, les élèves sont soutenus dans leur cheminement vers un bienêtre optimal grâce à une communauté scolaire saine qui met l’accent sur : <br/> <ul> <li>le développement des habiletés motrices</li> <li>la vie active</li> <li>la croissance et le développement physique</li> <li>la sécurité</li> <li>l’épanouissement personnel, la santé mentale et le bienêtre</li> <li>la nutrition et l’alimentation saine</li> <li>les relations saines.</li> </ul>"
        }
      },
      {
        "titles": {
          "en-ca": "Why Is Physical Education and Wellness Important?",
          "fr-ca": "Pourquoi l’éducation physique et le bienêtre sont-ils importants?"
        },
        "contents": {
          "en-ca": "Physical education improves the quality of life for individuals, families, and communities. As students become physically literate, they develop the motivation, confidence, physical competence, and knowledge to value and take responsibility for engaging in a wide range of physical activities for life. Within various indoor, outdoor, and alternative environments, students experience meaningful learning opportunities as they engage in <br/> <ul> <li>rhythmic, gymnastic, and expressive activities</li> <li>individual and group activities</li> <li>challenge and adventure activities</li> <li>cultural activities</li> <li>games</li> </ul> Wellness education promotes the vitality of individuals and communities and provides students with opportunities to learn about various aspects of health and well-being, and make informed decisions. As students grow and develop, they access, comprehend, evaluate, communicate, and apply health and wellness-related information as a means of promoting, maintaining, and improving well-being in a variety of settings throughout their lifetime. Students who understand the importance of their well-being can make healthy living choices because they have developed essential knowledge and skills.",
          "fr-ca": "L’éducation physique améliore la qualité de vie des personnes, des familles et des communautés. À mesure que les élèves développent la littératie physique, ils favorisent également la motivation, la confiance, les compétences physiques et les connaissances nécessaires pour valoriser et assumer la responsabilité de s’engager dans un large éventail d’activités physiques pour la vie. Dans divers environnements intérieurs, extérieurs et alternatifs, les élèves bénéficient d’occasions d’apprentissage significatives lorsqu’ils s’engagent dans : <br/> <ul> <li>les activités rythmiques, gymnastiques et expressives</li> <li>les activités individuelles et de groupe</li> <li>les activités de défi et d’aventure</li> <li>les activités culturelles</li> <li>les jeux.</li> </ul> Le programme de bienêtre favorise la vitalité des personnes et des communautés et offre aux élèves la possibilité de s’informer sur les différents aspects de la santé et du bienêtre, et de prendre des décisions éclairées. En grandissant et en se développant, les élèves accèdent à des informations relatives à la santé et au bienêtre. Ils comprennent, évaluent, communiquent et appliquent ces informations afin de promouvoir, de maintenir et d’améliorer le bienêtre dans divers contextes tout au long de leur vie. Les élèves qui comprennent l’importance de leur bienêtre peuvent faire des choix de vie sains parce qu’ils ont acquis des connaissances et des compétences essentielles."
        }
      }
    ]
  },
  {
    "code": "SCI",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "What Is Science?",
          "fr-ca": "Qu’est-ce que les sciences?"
        },
        "contents": {
          "en-ca": "Science is a human endeavour in which curiosity, creativity, and perseverance are used to obtain a deeper understanding of the natural world. Science includes the interconnected disciplines of physics, chemistry, biology, Earth science, astronomy, and computer science. Science is a self-correcting way of knowing about the world that uses cyclical and iterative scientific methods to develop and refine scientific knowledge. Scientific methods include formulating scientific questions and hypotheses, then investigating them through objectively observing, collecting, and analyzing data to formulate conclusions and explanations based on evidence. Scientific knowledge refers to objective, evidence-based observations and explanations of testable phenomena that are accepted by the scientific community. Scientific knowledge is organized according to classification systems and subject to change when new evidence is presented. Science includes the critical thinking skills, scientific knowledge, and civic literacy required to respond to relevant personal, societal, and environmental issues. Science knowledge is enriched through the shared contributions of people from diverse cultures and perspectives. Science is essential in developing innovative ideas and solutions to address local and global challenges now and in the future.",
          "fr-ca": "Les sciences sont une entreprise humaine dans laquelle la curiosité, la créativité et la persévérance sont utilisées pour obtenir une compréhension plus approfondie du monde naturel. Les sciences comprennent les disciplines interconnectées que sont la physique, la chimie, la biologie, les sciences de la terre, l’astronomie et l’informatique. Les sciences sont une manière autocorrectrice de connaitre le monde qui utilise des méthodes scientifiques cycliques et itératives pour acquérir et affiner les connaissances scientifiques. Les méthodes scientifiques comprennent la formulation de questions et d’hypothèses scientifiques, puis leur étude par l’observation objective, la collecte et l’analyse de données afin de formuler des conclusions et des explications fondées sur des preuves. Les connaissances scientifiques se réfèrent à des observations et des explications objectives, fondées sur des preuves, de phénomènes vérifiables et acceptées par la communauté scientifique. Les connaissances scientifiques sont organisées selon des systèmes de classification et sont susceptibles de changer lorsque de nouvelles preuves sont présentées. Les sciences comprennent les habiletés de réflexion critique, les connaissances scientifiques et les connaissances civiques nécessaires pour répondre aux questions personnelles, sociétales et environnementales pertinentes. Les connaissances scientifiques sont enrichies par les contributions communes de personnes de cultures et de perspectives différentes. Les sciences sont essentielles à l’élaboration d’idées et de solutions innovantes pour répondre aux défis locaux et mondiaux actuels et futurs. "
        }
      },
      {
        "titles": {
          "en-ca": "Why Is Science Important?",
          "fr-ca": "Pourquoi les sciences sont-elles importantes?"
        },
        "contents": {
          "en-ca": "Science allows students to nurture their innate curiosity and acquire knowledge through the process of investigation. Investigation in science provides students with opportunities to apply their knowledge, communicate their thoughts, and evaluate evidence to make informed decisions. The study of science enables students to develop critical thinking skills and scientific literacy. Scientifically literate citizens are better equipped to evaluate sources of information encountered in daily life and to pursue a wide variety of scientific and technological interests, studies, or career options. <br/><br/> Science and technology are deeply interwoven into many aspects of daily life. Together, they allow society to generate and share knowledge, innovate, improve quality of life, and predict future events. The study of science allows students to develop a deeper understanding of the natural world, consider the impact of their actions, and recognize the responsibility we share for environmental stewardship and sustainability.",
          "fr-ca": "Les sciences permettent aux élèves de nourrir leur curiosité innée et d’acquérir des connaissances par le biais du processus de recherche. La recherche scientifique donne aux élèves la possibilité d’appliquer leurs connaissances, de communiquer leurs pensées et d’évaluer les preuves afin de prendre des décisions éclairées. L’étude des sciences permet aux élèves de développer des habiletés de pensée critique et leur culture scientifique. Les citoyens qui possèdent une culture scientifique sont mieux équipés pour évaluer les sources d’information rencontrées dans la vie quotidienne et pour poursuivre une grande variété d’intérêts, d’études ou d’options de carrière dans le domaine scientifique et technologique. <br/><br/> Les sciences et la technologie sont profondément imbriquées dans de nombreux aspects de la vie quotidienne. Ensemble, elles permettent à la société de générer et de partager des connaissances, d’innover, d’améliorer la qualité de vie et de prévoir les évènements futurs. L’étude des sciences permet aux élèves de mieux comprendre le monde naturel, d’examiner les conséquences de leurs actions et de reconnaitre la responsabilité que nous partageons en matière de gestion et de durabilité de l’environnement."
        }
      }
    ]
  },
  {
    "code": "OLAFLA",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "Qu’est-ce que Français immersion et littérature?",
          "fr-ca": "Qu’est-ce que Français immersion et littérature?"
        },
        "contents": {
          "en-ca": "Français immersion et littérature est le cours de français pour les élèves inscrits au programme d’immersion française. Le curriculum de ce cours définit dans un langage clair et précis ce que les élèves doivent savoir, comprendre et être capables de faire pour développer leurs habiletés reliées à la langue française et favoriser l’établissement de liens entre les langues. <br/><br/> Français immersion et littérature offre aux élèves l’occasion d’enrichir leurs expériences et d’acquérir des compétences et des connaissances fondamentales de manière séquentielle. En appliquant des connaissances et habiletés reliées à la conscience phonologique, la phonétique, l’orthographe correcte des mots, l’acquisition du vocabulaire et la fluidité en lecture, les élèves développent une compréhension des liens qui existent entre la langue orale et la langue écrite et les caractéristiques grammaticales et textuelles propres au français permettant ainsi une communication claire et efficace. Le développement de la communication orale joue un rôle central dans le développement du français en tant que langue supplémentaire. L’établissement de liens entre l’oral et l’écrit permet aux élèves de maximiser leurs apprentissages et de comprendre les caractéristiques de la langue française. Dans ce cours, les habiletés de communication se développent à travers des interactions contextualisées tant à l’oral qu’à l’écrit, offrant des occasions aux élèves d’apprendre à s’exprimer dans divers contextes, et ce, en respectant progressivement les caractéristiques grammaticales et textuelles qui sont propres à la langue française. <br/><br/> Français immersion et littérature permet aux élèves de comprendre les liens entre la pensée et le langage et d’apprécier la beauté de la langue française et des cultures francophones plurielles à travers une variété de textes. Un texte, numérique ou non numérique, est tout ce qui est écrit, oral ou visuel, est porteur de sens et sert à communiquer ou à transmettre un message. Ce cours permet aux élèves de communiquer avec fierté, confiance et respect en français en offrant des contextes et des apprentissages qui favorisent l’atteinte de buts langagiers tout au long de leur parcours scolaire. ",
          "fr-ca": "Français immersion et littérature est le cours de français pour les élèves inscrits au programme d’immersion française. Le curriculum de ce cours définit dans un langage clair et précis ce que les élèves doivent savoir, comprendre et être capables de faire pour développer leurs habiletés reliées à la langue française et favoriser l’établissement de liens entre les langues. <br/><br/> Français immersion et littérature offre aux élèves l’occasion d’enrichir leurs expériences et d’acquérir des compétences et des connaissances fondamentales de manière séquentielle. En appliquant des connaissances et habiletés reliées à la conscience phonologique, la phonétique, l’orthographe correcte des mots, l’acquisition du vocabulaire et la fluidité en lecture, les élèves développent une compréhension des liens qui existent entre la langue orale et la langue écrite et les caractéristiques grammaticales et textuelles propres au français permettant ainsi une communication claire et efficace. Le développement de la communication orale joue un rôle central dans le développement du français en tant que langue supplémentaire. L’établissement de liens entre l’oral et l’écrit permet aux élèves de maximiser leurs apprentissages et de comprendre les caractéristiques de la langue française. Dans ce cours, les habiletés de communication se développent à travers des interactions contextualisées tant à l’oral qu’à l’écrit, offrant des occasions aux élèves d’apprendre à s’exprimer dans divers contextes, et ce, en respectant progressivement les caractéristiques grammaticales et textuelles qui sont propres à la langue française. <br/><br/> Français immersion et littérature permet aux élèves de comprendre les liens entre la pensée et le langage et d’apprécier la beauté de la langue française et des cultures francophones plurielles à travers une variété de textes. Un texte, numérique ou non numérique, est tout ce qui est écrit, oral ou visuel, est porteur de sens et sert à communiquer ou à transmettre un message. Ce cours permet aux élèves de communiquer avec fierté, confiance et respect en français en offrant des contextes et des apprentissages qui favorisent l’atteinte de buts langagiers tout au long de leur parcours scolaire. "
        }
      },
      {
        "titles": {
          "en-ca": "Pourquoi le programme de Français immersion et littérature est-il important?",
          "fr-ca": "Pourquoi le programme de Français immersion et littérature est-il important?"
        },
        "contents": {
          "en-ca": "De la maternelle à la 6<sup>e</sup> année, les élèves développent les fondements en littératie en ayant l’occasion d’expérimenter la langue grâce à la lecture, à l’écriture, à l’expression, à l’écoute et au visionnement de textes variés. Le cours de Français immersion et littérature favorise le développement des habiletés de pensée et de communication dans le but d’interagir avec différents publics dans des contextes et médias variés. <br/><br/> Français immersion et littérature permet d’apprécier la richesse de la langue française, ainsi que la diversité des communautés et des cultures canadiennes et mondiales. Ce cours fournit aux élèves des occasions de comprendre et d’apprécier les apports et les perspectives de diverses communautés, y compris des Premières Nations, des Métis et des <em>Inuit</em>, leur permettant de reconnaitre comment l’apprentissage d’une langue peut influencer l’ouverture d’esprit et la compréhension mutuelle.",
          "fr-ca": "De la maternelle à la 6<sup>e</sup> année, les élèves développent les fondements en littératie en ayant l’occasion d’expérimenter la langue grâce à la lecture, à l’écriture, à l’expression, à l’écoute et au visionnement de textes variés. Le cours de Français immersion et littérature favorise le développement des habiletés de pensée et de communication dans le but d’interagir avec différents publics dans des contextes et médias variés. <br/><br/> Français immersion et littérature permet d’apprécier la richesse de la langue française, ainsi que la diversité des communautés et des cultures canadiennes et mondiales. Ce cours fournit aux élèves des occasions de comprendre et d’apprécier les apports et les perspectives de diverses communautés, y compris des Premières Nations, des Métis et des <em>Inuit</em>, leur permettant de reconnaitre comment l’apprentissage d’une langue peut influencer l’ouverture d’esprit et la compréhension mutuelle."
        }
      }
    ]
  },
  {
    "code": "LANENG",
    "parentCode": "",
    "sections": [
      {
        "titles": {
          "en-ca": "What Is English Language Arts and Literature?",
          "fr-ca": "What Is English Language Arts and Literature?"
        },
        "contents": {
          "en-ca": "English language arts and literature is a subject that provides students with language and literacy skills required for success in the twenty-first century. From Kindergarten to Grade 6, students gain foundational knowledge and build on their language skills and experiences through reading, writing, listening, speaking, viewing, and representing. These strands of learning are closely interrelated and complementary; literacy skills in each of these strands reinforce and strengthen skills in the others. Through practice and experience, students understand how language is used in a variety of formal and informal contexts. Studying English language arts and literature involves reading, appreciating, and becoming familiar with influential writers whose works illustrate the essence of the human condition. Through the study of great texts, English language arts and literature lays the groundwork for critical thinking as well as personal expression.",
          "fr-ca": "English language arts and literature is a subject that provides students with language and literacy skills required for success in the twenty-first century. From Kindergarten to Grade 6, students gain foundational knowledge and build on their language skills and experiences through reading, writing, listening, speaking, viewing, and representing. These strands of learning are closely interrelated and complementary; literacy skills in each of these strands reinforce and strengthen skills in the others. Through practice and experience, students understand how language is used in a variety of formal and informal contexts. Studying English language arts and literature involves reading, appreciating, and becoming familiar with influential writers whose works illustrate the essence of the human condition. Through the study of great texts, English language arts and literature lays the groundwork for critical thinking as well as personal expression."
        }
      },
      {
        "titles": {
          "en-ca": "Why Is English Language Arts and Literature Important?",
          "fr-ca": "Why Is English Language Arts and Literature Important?"
        },
        "contents": {
          "en-ca": "English language arts and literature is essential to foundational literacy and communication skills for lifelong learning. Being a literate, effective communicator is necessary for skillful public speaking and career readiness. Similarly, engaging in respectful and inclusive dialogue and considering varied viewpoints can enhance new ways of thinking. Students learn the difference between fact and opinion and support their opinions with evidence, demonstrating reasoning skills while considering multiple sources of information. By acquiring and applying a rich vocabulary, students, throughout Kindergarten to Grade 6, become flexible and precise communicators. They develop reading comprehension skills, which supports managing information, interpreting ideas, and researching varied topics—all crucial skills for learning and studying in the secondary grades, at the post-secondary level, and in the world of work. <br/><br/> Students read great texts from many traditions that have shaped our society and understand that multiple perspectives can be explored through these historical, traditional, classical, cultural, and contemporary texts. Students come to realize that the definition of “text” is quite broad, that a text refers to any object or experience with which readers, writers, listeners, speakers, viewers, and representers engage to make sense of their world. Texts are more than oral, print, visual, digital, and multimedia resources. They also encompass cultural artifacts, encounters with the land, and everyday communications. <br/><br/> Through exposure to and exploration of enduring art, writing, and texts across different time periods and places, students recognize truth, beauty, and goodness. Students develop various techniques for adding elements of beauty and persuasion to their composition of texts, keeping their audiences in mind. They also learn to write with clarity and confidence and use appropriate grammar and spelling in various genres for a variety of audiences. Students integrate their understandings of language and literature to think for themselves, to make connections, to solve problems, and to find creative solutions, all while collaborating and building positive relationships. As well-versed, literate learners with a comprehensive skill set, students are able to face challenges, demonstrate character and resiliency, and adapt to changing conditions.",
          "fr-ca": "English language arts and literature is essential to foundational literacy and communication skills for lifelong learning. Being a literate, effective communicator is necessary for skillful public speaking and career readiness. Similarly, engaging in respectful and inclusive dialogue and considering varied viewpoints can enhance new ways of thinking. Students learn the difference between fact and opinion and support their opinions with evidence, demonstrating reasoning skills while considering multiple sources of information. By acquiring and applying a rich vocabulary, students, throughout Kindergarten to Grade 6, become flexible and precise communicators. They develop reading comprehension skills, which supports managing information, interpreting ideas, and researching varied topics—all crucial skills for learning and studying in the secondary grades, at the post-secondary level, and in the world of work. <br/><br/> Students read great texts from many traditions that have shaped our society and understand that multiple perspectives can be explored through these historical, traditional, classical, cultural, and contemporary texts. Students come to realize that the definition of “text” is quite broad, that a text refers to any object or experience with which readers, writers, listeners, speakers, viewers, and representers engage to make sense of their world. Texts are more than oral, print, visual, digital, and multimedia resources. They also encompass cultural artifacts, encounters with the land, and everyday communications. <br/><br/> Through exposure to and exploration of enduring art, writing, and texts across different time periods and places, students recognize truth, beauty, and goodness. Students develop various techniques for adding elements of beauty and persuasion to their composition of texts, keeping their audiences in mind. They also learn to write with clarity and confidence and use appropriate grammar and spelling in various genres for a variety of audiences. Students integrate their understandings of language and literature to think for themselves, to make connections, to solve problems, and to find creative solutions, all while collaborating and building positive relationships. As well-versed, literate learners with a comprehensive skill set, students are able to face challenges, demonstrate character and resiliency, and adapt to changing conditions."
        }
      }
    ]
  }
]
